# Built In Failures Slab Shape Failures Slab Shape Cannot Paste Subpicks Invalid Target Property

Source: https://www.revitapidocs.com/2026/c6ec765a-72dd-5273-113d-e2c6bdaf3dad.htm

---

| Built In Failures Slab Shape Failures Slab Shape Cannot Paste Subpicks Invalid Target Property |
| --- |

Cannot paste points or lines. Select a slab and modify sub elements to paste points or lines.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId SlabShapeCannotPasteSubpicksInvalidTarget { get; }
```

```
Public Shared ReadOnly Property SlabShapeCannotPasteSubpicksInvalidTarget As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ SlabShapeCannotPasteSubpicksInvalidTarget {
	FailureDefinitionId^ get ();
}
```

```
static member SlabShapeCannotPasteSubpicksInvalidTarget : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures SlabShapeFailures Class Autodesk.Revit.DB Namespace